src/main/java/ok/dht/test/slastin/wrk2/data/get-250.txt
Running 1m test @ http://localhost:2022
  1 threads and 1 connections
  Thread calibration: mean lat.: 2.205ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.19ms  645.45us  11.09ms   68.55%
    Req/Sec   263.07     52.25   500.00     58.65%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.14ms
 75.000%    2.60ms
 90.000%    3.02ms
 99.000%    3.76ms
 99.900%    5.34ms
 99.990%    9.61ms
 99.999%   11.10ms
100.000%   11.10ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.619     0.000000            1         1.00
       1.391     0.100000         1252         1.11
       1.645     0.200000         2502         1.25
       1.832     0.300000         3757         1.43
       1.983     0.400000         5004         1.67
       2.145     0.500000         6258         2.00
       2.239     0.550000         6882         2.22
       2.323     0.600000         7507         2.50
       2.415     0.650000         8126         2.86
       2.507     0.700000         8761         3.33
       2.601     0.750000         9374         4.00
       2.659     0.775000         9688         4.44
       2.723     0.800000        10004         5.00
       2.785     0.825000        10318         5.71
       2.853     0.850000        10624         6.67
       2.927     0.875000        10939         8.00
       2.969     0.887500        11092         8.89
       3.017     0.900000        11254        10.00
       3.067     0.912500        11406        11.43
       3.119     0.925000        11563        13.33
       3.185     0.937500        11722        16.00
       3.213     0.943750        11797        17.78
       3.247     0.950000        11874        20.00
       3.287     0.956250        11955        22.86
       3.329     0.962500        12037        26.67
       3.397     0.968750        12110        32.00
       3.427     0.971875        12148        35.56
       3.457     0.975000        12186        40.00
       3.507     0.978125        12225        45.71
       3.545     0.981250        12265        53.33
       3.613     0.984375        12304        64.00
       3.649     0.985938        12327        71.11
       3.697     0.987500        12342        80.00
       3.733     0.989062        12364        91.43
       3.799     0.990625        12381       106.67
       3.887     0.992188        12401       128.00
       3.951     0.992969        12411       142.22
       4.001     0.993750        12420       160.00
       4.045     0.994531        12431       182.86
       4.143     0.995313        12440       213.33
       4.239     0.996094        12451       256.00
       4.335     0.996484        12455       284.44
       4.379     0.996875        12459       320.00
       4.455     0.997266        12464       365.71
       4.575     0.997656        12469       426.67
       4.695     0.998047        12474       512.00
       4.727     0.998242        12477       568.89
       4.955     0.998437        12479       640.00
       5.059     0.998633        12482       731.43
       5.195     0.998828        12484       853.33
       5.343     0.999023        12486      1024.00
       5.527     0.999121        12488      1137.78
       5.575     0.999219        12489      1280.00
       6.055     0.999316        12490      1462.86
       6.159     0.999414        12491      1706.67
       6.287     0.999512        12492      2048.00
       6.399     0.999561        12493      2275.56
       6.459     0.999609        12494      2560.00
       6.459     0.999658        12494      2925.71
       6.915     0.999707        12495      3413.33
       6.915     0.999756        12495      4096.00
       7.755     0.999780        12496      4551.11
       7.755     0.999805        12496      5120.00
       7.755     0.999829        12496      5851.43
       9.615     0.999854        12497      6826.67
       9.615     0.999878        12497      8192.00
       9.615     0.999890        12497      9102.22
       9.615     0.999902        12497     10240.00
       9.615     0.999915        12497     11702.86
      11.095     0.999927        12498     13653.33
      11.095     1.000000        12498          inf
#[Mean    =        2.190, StdDeviation   =        0.645]
#[Max     =       11.088, Total count    =        12498]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  15000 requests in 1.00m, 3.06MB read
Requests/sec:    250.00
Transfer/sec:     52.16KB