src/main/java/ok/dht/test/slastin/wrk2/data/get-2500.txt
Running 1m test @ http://localhost:2022
  1 threads and 1 connections
  Thread calibration: mean lat.: 238.724ms, rate sampling interval: 2177ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   521.96ms  692.33ms   2.25s    77.94%
    Req/Sec     2.56k   342.97     3.11k    68.18%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   22.91ms
 75.000%    1.13s 
 90.000%    1.58s 
 99.000%    2.18s 
 99.900%    2.25s 
 99.990%    2.25s 
 99.999%    2.25s 
100.000%    2.25s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.242     0.000000            1         1.00
       0.745     0.100000        12802         1.11
       1.161     0.200000        25583         1.25
       2.781     0.300000        38367         1.43
       8.727     0.400000        51158         1.67
      22.911     0.500000        63943         2.00
      37.727     0.550000        70344         2.22
     225.663     0.600000        76728         2.50
     689.151     0.650000        83124         2.86
     979.455     0.700000        89524         3.33
    1134.591     0.750000        95961         4.00
    1208.319     0.775000        99117         4.44
    1260.543     0.800000       102351         5.00
    1355.775     0.825000       105514         5.71
    1461.247     0.850000       108739         6.67
    1503.231     0.875000       111972         8.00
    1529.855     0.887500       113540         8.89
    1575.935     0.900000       115112        10.00
    1601.535     0.912500       116699        11.43
    1701.887     0.925000       118300        13.33
    1802.239     0.937500       119888        16.00
    1857.535     0.943750       120705        17.78
    1899.519     0.950000       121498        20.00
    1953.791     0.956250       122290        22.86
    2006.015     0.962500       123133        26.67
    2042.879     0.968750       123905        32.00
    2065.407     0.971875       124296        35.56
    2086.911     0.975000       124711        40.00
    2093.055     0.978125       125088        45.71
    2111.487     0.981250       125492        53.33
    2136.063     0.984375       125902        64.00
    2148.351     0.985938       126089        71.11
    2162.687     0.987500       126300        80.00
    2174.975     0.989062       126553        91.43
    2183.167     0.990625       126695       106.67
    2195.455     0.992188       126917       128.00
    2201.599     0.992969       126999       142.22
    2207.743     0.993750       127094       160.00
    2215.935     0.994531       127202       182.86
    2220.031     0.995313       127292       213.33
    2226.175     0.996094       127413       256.00
    2228.223     0.996484       127456       284.44
    2230.271     0.996875       127502       320.00
    2234.367     0.997266       127555       365.71
    2236.415     0.997656       127595       426.67
    2240.511     0.998047       127650       512.00
    2242.559     0.998242       127685       568.89
    2242.559     0.998437       127685       640.00
    2244.607     0.998633       127719       731.43
    2246.655     0.998828       127746       853.33
    2248.703     0.999023       127768      1024.00
    2248.703     0.999121       127768      1137.78
    2250.751     0.999219       127840      1280.00
    2250.751     0.999316       127840      1462.86
    2250.751     0.999414       127840      1706.67
    2250.751     0.999512       127840      2048.00
    2250.751     0.999561       127840      2275.56
    2250.751     0.999609       127840      2560.00
    2250.751     0.999658       127840      2925.71
    2252.799     0.999707       127865      3413.33
    2252.799     0.999756       127865      4096.00
    2252.799     0.999780       127865      4551.11
    2252.799     0.999805       127865      5120.00
    2252.799     0.999829       127865      5851.43
    2252.799     0.999854       127865      6826.67
    2252.799     0.999878       127865      8192.00
    2252.799     0.999890       127865      9102.22
    2254.847     0.999902       127879     10240.00
    2254.847     1.000000       127879          inf
#[Mean    =      521.956, StdDeviation   =      692.332]
#[Max     =     2252.800, Total count    =       127879]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  149972 requests in 1.00m, 30.56MB read
Requests/sec:   2499.55
Transfer/sec:    521.57KB