src/main/java/ok/dht/test/slastin/wrk2/data/get-500.txt
Running 1m test @ http://localhost:2022
  1 threads and 1 connections
  Thread calibration: mean lat.: 6.965ms, rate sampling interval: 47ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.84ms   11.27ms  81.02ms   89.93%
    Req/Sec   505.06     81.02     1.21k    86.24%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.85ms
 75.000%    2.67ms
 90.000%   17.34ms
 99.000%   55.81ms
 99.900%   75.39ms
 99.990%   80.83ms
 99.999%   81.09ms
100.000%   81.09ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.390     0.000000            1         1.00
       1.138     0.100000         2504         1.11
       1.347     0.200000         5004         1.25
       1.525     0.300000         7506         1.43
       1.689     0.400000        10003         1.67
       1.846     0.500000        12505         2.00
       1.928     0.550000        13751         2.22
       2.016     0.600000        15014         2.50
       2.117     0.650000        16254         2.86
       2.281     0.700000        17505         3.33
       2.667     0.750000        18755         4.00
       3.073     0.775000        19374         4.44
       3.813     0.800000        20000         5.00
       5.071     0.825000        20624         5.71
       7.019     0.850000        21249         6.67
      10.959     0.875000        21874         8.00
      13.911     0.887500        22188         8.89
      17.343     0.900000        22499        10.00
      21.599     0.912500        22811        11.43
      25.119     0.925000        23124        13.33
      29.311     0.937500        23436        16.00
      31.743     0.943750        23592        17.78
      34.015     0.950000        23749        20.00
      35.999     0.956250        23909        22.86
      38.335     0.962500        24063        26.67
      41.247     0.968750        24217        32.00
      42.591     0.971875        24295        35.56
      44.127     0.975000        24375        40.00
      45.727     0.978125        24452        45.71
      47.391     0.981250        24532        53.33
      49.567     0.984375        24608        64.00
      51.039     0.985938        24647        71.11
      52.607     0.987500        24686        80.00
      54.463     0.989062        24725        91.43
      57.119     0.990625        24764       106.67
      59.647     0.992188        24805       128.00
      60.959     0.992969        24823       142.22
      61.919     0.993750        24842       160.00
      62.655     0.994531        24863       182.86
      64.607     0.995313        24881       213.33
      67.071     0.996094        24901       256.00
      68.415     0.996484        24911       284.44
      69.183     0.996875        24921       320.00
      69.951     0.997266        24930       365.71
      70.911     0.997656        24942       426.67
      71.807     0.998047        24950       512.00
      72.255     0.998242        24955       568.89
      73.215     0.998437        24959       640.00
      73.983     0.998633        24964       731.43
      74.559     0.998828        24969       853.33
      75.775     0.999023        24974      1024.00
      76.863     0.999121        24977      1137.78
      77.503     0.999219        24979      1280.00
      78.143     0.999316        24981      1462.86
      78.655     0.999414        24984      1706.67
      79.167     0.999512        24986      2048.00
      79.359     0.999561        24989      2275.56
      79.359     0.999609        24989      2560.00
      79.871     0.999658        24991      2925.71
      79.871     0.999707        24991      3413.33
      80.063     0.999756        24992      4096.00
      80.319     0.999780        24993      4551.11
      80.511     0.999805        24994      5120.00
      80.511     0.999829        24994      5851.43
      80.703     0.999854        24995      6826.67
      80.703     0.999878        24995      8192.00
      80.831     0.999890        24996      9102.22
      80.831     0.999902        24996     10240.00
      80.831     0.999915        24996     11702.86
      80.959     0.999927        24997     13653.33
      80.959     0.999939        24997     16384.00
      80.959     0.999945        24997     18204.44
      80.959     0.999951        24997     20480.00
      80.959     0.999957        24997     23405.71
      81.087     0.999963        24998     27306.67
      81.087     1.000000        24998          inf
#[Mean    =        5.837, StdDeviation   =       11.272]
#[Max     =       81.024, Total count    =        24998]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30001 requests in 1.00m, 6.11MB read
Requests/sec:    500.01
Transfer/sec:    104.31KB